def get_flag(code):
    flags = {
        "AL": "🇦🇱", "AD": "🇦🇩", "AR": "🇦🇷", "AM": "🇦🇲", "AU": "🇦🇺",
        "AT": "🇦🇹", "AZ": "🇦🇿", "BE": "🇧🇪", "BJ": "🇧🇯", "BO": "🇧🇴",
        "BA": "🇧🇦", "BR": "🇧🇷", "BG": "🇧🇬", "CA": "🇨🇦", "CL": "🇨🇱",
        "CN": "🇨🇳", "CO": "🇨🇴", "HR": "🇭🇷", "CY": "🇨🇾", "CZ": "🇨🇿",
        "DK": "🇩🇰", "EC": "🇪🇨", "ER": "🇪🇷", "EE": "🇪🇪", "FI": "🇫🇮",
        "FR": "🇫🇷", "GE": "🇬🇪", "DE": "🇩🇪", "GB": "🇬🇧", "GR": "🇬🇷",
        "GW": "🇬🇼", "HT": "🇭🇹", "HK": "🇭🇰", "HU": "🇭🇺", "IS": "🇮🇸",
        "IN": "🇮🇳", "IR": "🇮🇷", "IE": "🇮🇪", "IL": "🇮🇱", "IT": "🇮🇹",
        "JM": "🇯🇲", "JP": "🇯🇵", "KZ": "🇰🇿", "KE": "🇰🇪", "XK": "🇽🇰",
        "KG": "🇰🇬", "LV": "🇱🇻", "LB": "🇱🇧", "LI": "🇱🇮", "LT": "🇱🇹",
        "LU": "🇱🇺", "MG": "🇲🇬", "MY": "🇲🇾", "MT": "🇲🇹", "MX": "🇲🇽",
        "MD": "🇲🇩", "MC": "🇲🇨", "MN": "🇲🇳", "ME": "🇲🇪", "MA": "🇲🇦",
        "NL": "🇳🇱", "NZ": "🇳🇿", "NG": "🇳🇬", "MK": "🇲🇰", "NO": "🇳🇴",
        "PK": "🇵🇰", "PH": "🇵🇭", "PL": "🇵🇱", "PT": "🇵🇹", "PR": "🇵🇷",
        "RO": "🇷🇴", "SM": "🇸🇲", "SA": "🇸🇦", "RS": "🇷🇸", "SG": "🇸🇬",
        "SK": "🇸🇰", "SI": "🇸🇮", "ZA": "🇿🇦", "KR": "🇰🇷", "ES": "🇪🇸",
        "SE": "🇸🇪", "CH": "🇨🇭", "TH": "🇹🇭", "TT": "🇹🇹", "TR": "🇹🇷",
        "UA": "🇺🇦", "AE": "🇦🇪", "US": "🇺🇸", "UY": "🇺🇾", "UZ": "🇺🇿",
        "VE": "🇻🇪"
    }
    
    return flags.get(code, "Invalid country code")


"""
2026 Winter Games Day 1: Opening Day
Today marks the start of the 2026 Winter Games. 
The next 17 days will bring you coding challenges inspired by them.

For the first one, you are given a two-letter country code 
and need to return the flag emoji for that country.
"""